CfФитнесКлуб/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУпражнения</name>
    <type>
      <types>CatalogRef.ВидыУпражнений</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

CfФитнесКлуб/src/Enums/ВидНоменклатуры/ВидНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПосещениеУпражнения</name>
  </enumValues>
</mdclass:Enum>

CfФитнесКлуб/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
	УправлениеВидимостьюЭлФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
	УправлениеВидимостьюЭлФормы();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций
&НаСервере
Процедура УправлениеВидимостьюЭлФормы()
	ЭтоПосещенияУпражнения = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеУпражнения);
	Элементы.ВидУпражнения.Видимость = ЭтоПосещенияУпражнения;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещенияУпражнения;
КонецПроцедуры	

#КонецОбласти
